In [80]:
# Import pandas and read CSV
import pandas as pd 
taxi = pd.read_csv('/mnt/HC_Volume_18315164/home-jupyter/jupyter-i-sedelkin/practice/data/2_taxi_nyc.csv')

In [8]:
# Get df shape
taxi.shape

(29101, 14)

In [21]:
# Get df data types
taxi.dtypes

pickup_dt        object
pickup_month     object
borough          object
pickups           int64
hday             object
spd             float64
vsb             float64
temp            float64
dewp            float64
slp             float64
pcp_01          float64
pcp 06          float64
pcp_24          float64
sd              float64
dtype: object

In [25]:
# Rename columns
taxi = taxi.rename(columns={'pcp 01': 'pcp_01', 'pcp 06': 'pcp_06', 'pcp 24': 'pcp_24'})
taxi.head()

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

In [43]:
# Count values
taxi['borough'].value_counts()

Queens           4343
Manhattan        4343
Staten Island    4343
Brooklyn         4343
EWR              4343
Bronx            4343
Name: borough, dtype: int64

In [32]:
# Sum values
taxi['pickups'].sum()

14265773

In [74]:
# Max total pickups by borough
taxi \
    .groupby('borough', as_index=False) \
    .agg({'pickups': 'sum'}) \
    .sort_values(by='pickups', ascending=False)

         borough   pickups
3      Manhattan  10367841
1       Brooklyn   2321035
4         Queens   1343528
0          Bronx    220047
5  Staten Island      6957
2            EWR       105

In [60]:
# Return minimum index and maximum index (idxmax)
min_pickups = taxi.groupby('borough').agg({'pickups': 'sum'}).idxmin()

In [76]:
# Group by multiple columns
taxi. \
    groupby(['borough', 'hday'], as_index=False).agg({'pickups': 'mean'}) \
    .sort_values(by='pickups', ascending=False)

          borough hday      pickups
6       Manhattan    N  2401.302921
7       Manhattan    Y  2035.928144
2        Brooklyn    N   534.727969
3        Brooklyn    Y   527.011976
9          Queens    Y   320.730539
8          Queens    N   308.899904
0           Bronx    N    50.771073
1           Bronx    Y    48.065868
10  Staten Island    N     1.606082
11  Staten Island    Y     1.497006
5             EWR    Y     0.041916
4             EWR    N     0.023467

In [79]:
# Group by multiple columns
pickups_by_mon_bor = taxi. \
    groupby(['borough', 'pickup_month'], as_index=False).agg({'pickups': 'sum'}) \
    .sort_values(by='pickups', ascending=False)

In [83]:
# Write custom functions
def temp_to_celcius(temp_f):
    temp_c = (temp_f-32)*5/9
    return temp_c

In [86]:
taxi['temp'][:5]

0    30.0
1    30.0
2    30.0
3    30.0
4    30.0
Name: temp, dtype: float64

In [87]:
taxi['temp_C'] = temp_to_celcius(taxi['temp'])
taxi['temp_C'][:5]

0   -1.111111
1   -1.111111
2   -1.111111
3   -1.111111
4   -1.111111
Name: temp_C, dtype: float64

In [ ]:
bookings.query()